LIUGUOXIA/Demo/STM32-F1bsp-2022-9-29/STM32-F1bsp/BSP/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*
*	模块名称 : 串口中断+FIFO驱动模块
*	文件名称 : bsp_uart_fifo.c
*	版    本 : V1.0
*	说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问
*	修改记录 :
*		版本号  日期       作者    说明
*		V1.0    2013-02-01 armfly  正式发布
*		V1.1    2013-06-09 armfly  FiFo结构增加TxCount成员变量，方便判断缓冲区满; 增加 清FiFo的函数
*		V1.2	2014-09-29 armfly  增加RS485 MODBUS接口。接收到新字节后，直接执行回调函数。
*		V1.3	2015-07-23 armfly  增加 UART_T 结构的读写指针几个成员变量必须增加 __IO 修饰,否则优化后
*					会导致串口发送函数死机。
*		V1.4	2015-08-04 armfly  解决UART4配置bug  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_USART1);
*		V1.5	2015-10-08 armfly  增加修改波特率的接口函数
*
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "bsp_uart_fifo.h"

//#define RCC_AHB1Periph_GPIOA
//#define RCC_AHB1Periph_GPIOB
//#define RCC_AHB1Periph_GPIOC
//#define RCC_AHB1Periph_GPIOD
//#define RCC_AHB1Periph_GPIOG



/* 串口1的GPIO --- RS323 */
#define UART1_TX_PORT      GPIOA
#define UART1_TX_PIN       GPIO_Pin_9
#define UART1_TX_CLK       RCC_AHB1Periph_GPIOA
#define UART1_TX_SOURCE    GPIO_PinSource9

#define UART1_RX_PORT      GPIOA
#define UART1_RX_PIN       GPIO_Pin_10
#define UART1_RX_CLK       RCC_AHB1Periph_GPIOA
#define UART1_RX_SOURCE    GPIO_PinSource10

/* 串口2的GPIO  --- 只用了RX， 没用TX，硬件没有接（可用0欧姆接上） */
#define UART2_TX_PORT      GPIOA
#define UART2_TX_PIN       GPIO_Pin_2
#define UART2_TX_CLK       RCC_AHB1Periph_GPIOA
#define UART2_TX_SOURCE    GPIO_PinSource2

#define UART2_RX_PORT      GPIOA
#define UART2_RX_PIN       GPIO_Pin_3
#define UART2_RX_CLK       RCC_AHB1Periph_GPIOA
#define UART2_RX_SOURCE    GPIO_PinSource3

/* 串口3的GPIO - RS485 */
#define UART3_TX_PORT      GPIOB
#define UART3_TX_PIN       GPIO_Pin_10
#define UART3_TX_CLK       RCC_AHB1Periph_GPIOB
#define UART3_TX_SOURCE    GPIO_PinSource10

#define UART3_RX_PORT      GPIOCB
#define UART3_RX_PIN       GPIO_Pin_11
#define UART3_RX_CLK       RCC_AHB1Periph_GPIOB
#define UART3_RX_SOURCE    GPIO_PinSource11

/* 串口4的GPIO - 在SDIO接口 */
#define UART4_TX_PORT      GPIOC
#define UART4_TX_PIN       GPIO_Pin_10
#define UART4_TX_CLK       RCC_AHB1Periph_GPIOC
#define UART4_TX_SOURCE    GPIO_PinSource10

#define UART4_RX_PORT      GPIOC
#define UART4_RX_PIN       GPIO_Pin_11
#define UART4_RX_CLK       RCC_AHB1Periph_GPIOC
#define UART4_RX_SOURCE    GPIO_PinSource11

/* 串口5的GPIO - 在SDIO接口 */
#define UART5_TX_PORT      GPIOC
#define UART5_TX_PIN       GPIO_Pin_12
#define UART5_TX_CLK       RCC_AHB1Periph_GPIOC
#define UART5_TX_SOURCE    GPIO_PinSource12

#define UART5_RX_PORT      GPIOD
#define UART5_RX_PIN       GPIO_Pin_2
#define UART5_RX_CLK       RCC_AHB1Periph_GPIOD
#define UART5_RX_SOURCE    GPIO_PinSource2

/* 串口6的GPIO -- GPRS,WIFI */
#define UART6_TX_PORT      GPIOG
#define UART6_TX_PIN       GPIO_Pin_14
#define UART6_TX_CLK       RCC_AHB1Periph_GPIOG
#define UART6_TX_SOURCE    GPIO_PinSource14

#define UART6_RX_PORT      GPIOC
#define UART6_RX_PIN       GPIO_Pin_7
#define UART6_RX_CLK       RCC_AHB1Periph_GPIOC
#define UART6_RX_SOURCE    GPIO_PinSource7

/* 定义每个串口结构体变量 */
#if UART1_FIFO_EN == 1
	static UART_T g_tUart1;
	static uint8_t g_TxBuf1[UART1_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf1[UART1_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART2_FIFO_EN == 1
	static UART_T g_tUart2;
	static uint8_t g_TxBuf2[UART2_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf2[UART2_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART3_FIFO_EN == 1
	static UART_T g_tUart3;
	static uint8_t g_TxBuf3[UART3_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf3[UART3_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART4_FIFO_EN == 1
	static UART_T g_tUart4;
	static uint8_t g_TxBuf4[UART4_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf4[UART4_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART5_FIFO_EN == 1
	static UART_T g_tUart5;
	static uint8_t g_TxBuf5[UART5_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf5[UART5_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART6_FIFO_EN == 1
	static UART_T g_tUart6;
	static uint8_t g_TxBuf6[UART6_TX_BUF_SIZE];		/* 发送缓冲区 */
	static uint8_t g_RxBuf6[UART6_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

static void UartVarInit(void);

static void InitHardUart(void);
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen);
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte);
static void UartIRQ(UART_T *_pUart);
static void ConfigUartNVIC(void);

void RS485_InitTXE(void);

/*
*********************************************************************************************************
*	函 数 名: bsp_InitUart
*	功能说明: 初始化串口硬件，并对全局变量赋初值.
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{
	UartVarInit();		/* 必须先初始化全局变量,再配置硬件 */

	InitHardUart();		/* 配置串口的硬件参数(波特率等) */

	RS485_InitTXE();	/* 配置RS485芯片的发送使能硬件，配置为推挽输出 */

	ConfigUartNVIC();	/* 配置串口中断 */
}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为UART指针
*	形    参: _ucPort: 端口号(COM1 - COM6)
*	返 回 值: uart指针
*********************************************************************************************************
*/
UART_T *ComToUart(COM_PORT_E _ucPort)
{
	if (_ucPort == COM1)
	{
		#if UART1_FIFO_EN == 1
			return &g_tUart1;
		#else
			return 0;
		#endif
	}
	else if (_ucPort == COM2)
	{
		#if UART2_FIFO_EN == 1
			return &g_tUart2;
		#else
			return;
		#endif
	}
	else if (_ucPort == COM3)
	{
		#if UART3_FIFO_EN == 1
			return &g_tUart3;
		#else
			return 0;
		#endif
	}
	else if (_ucPort == COM4)
	{
		#if UART4_FIFO_EN == 1
			return &g_tUart4;
		#else
			return 0;
		#endif
	}
	else if (_ucPort == COM5)
	{
		#if UART5_FIFO_EN == 1
			return &g_tUart5;
		#else
			return 0;
		#endif
	}
	else if (_ucPort == COM6)
	{
		#if UART6_FIFO_EN == 1
			return &g_tUart6;
		#else
			return 0;
		#endif
	}
	else
	{
		/* 不做任何处理 */
		return 0;
	}
}


