LIUGUOXIA/Demo/STM32-F1bsp-2022-9-29/STM32-F1bsp/BSP/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: UartSend
*	功能说明: 填写数据到UART发送缓冲区,并启动发送中断。中断处理函数发送完毕后，自动关闭发送中断
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
//参数：_pUart指向串口设备结构体的指针；_ucaBuf指向缓冲区的指针；_usLen发送长度大小
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
	uint16_t i;           //i用来遍历发送的数据长度

	for (i = 0; i < _usLen; i++)         
	{
		/* 如果发送缓冲区已经满了，则等待缓冲区空 */
	#if 0
		/*
			在调试GPRS例程时，下面的代码出现死机，while 死循环
			原因： 发送第1个字节时 _pUart->usTxWrite = 1；_pUart->usTxRead = 0;
			将导致while(1) 无法退出
		*/
		while (1)
		{
			uint16_t usRead;

			DISABLE_INT();
			usRead = _pUart->usTxRead;
			ENABLE_INT();

			if (++usRead >= _pUart->usTxBufSize)
			{
				usRead = 0;
			}

			if (usRead != _pUart->usTxWrite)
			{
				break;
			}
		}
	#else
		/* 当 _pUart->usTxBufSize == 1 时, 下面的函数会死掉(待完善) */
		while (1)
		{
			__IO uint16_t usCount;

			DISABLE_INT();
			usCount = _pUart->usTxCount;     //将待发送的数据个数赋给usCount计数
			ENABLE_INT();          //使能全局中断函数

			 //保证每次写入缓冲区时都能保证等待发送的个数都小于缓冲区本身的大小，当等待发送的数据个数超过缓冲区本身的大小时，程序将陷入死循环。
			if (usCount < _pUart->usTxBufSize)      
			{
				break;
			}
		}
	#endif

		/* 将新数据填入发送缓冲区 */
		_pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];   //通过此条语句将要发送的数据送入缓冲区,同时在将要发送的数据存储到缓冲区之后，就可以通过触发中断发送数据

		DISABLE_INT();     // 禁止全局中断
		if (++_pUart->usTxWrite >= _pUart->usTxBufSize)   //如果当前的写指针已经移动到FIFO的顶端时，对指针进行复位。
		{
			_pUart->usTxWrite = 0;
		}
		_pUart->usTxCount++;     //等待发送的数据个数   
		ENABLE_INT();
	}

	USART_ITConfig(_pUart->uart, USART_IT_TXE, ENABLE);    //使能串口发送中断
}

/*
*********************************************************************************************************
*	函 数 名: UartGetChar
*	功能说明: 从串口接收缓冲区读取1字节数据 （用于主程序调用）
*	形    参: _pUart : 串口设备
*			  _pByte : 存放读取数据的指针
*	返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte)
{
	uint16_t usCount;

	/* usRxWrite 变量在中断函数中被改写，主程序读取该变量时，必须进行临界区保护 */
	DISABLE_INT();
	usCount = _pUart->usRxCount;
	ENABLE_INT();

	/* 如果读和写索引相同，则返回0 */
	//if (_pUart->usRxRead == usRxWrite)
	if (usCount == 0)	/* 已经沒有数据则返回 */
	{
		return 0;
	}
	else
	{
		*_pByte = _pUart->pRxBuf[_pUart->usRxRead];		/* 从串口接收FIFO取1个数据 */   //*_pByte便是从缓冲区读出的值

		/* 改写FIFO读索引 */
		DISABLE_INT();
		if (++_pUart->usRxRead >= _pUart->usRxBufSize)    //pUart->usRxRead先加一再与 _pUart->usRxBufSize做比较
		{
			_pUart->usRxRead = 0;
		}
		_pUart->usRxCount--;
		ENABLE_INT();
		return 1;
	}
}


/*
*********************************************************************************************************
*	函 数 名: Uart_GetFifoSize
*	功能说明: 
*	形    参: _pUart : 串口设备
*			  _pByte : 存放读取数据的指针
*	返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
uint16_t Uart_GetFifoSize(COM_PORT_E port)
{
	UART_T *pUart;
	uint16_t size = 0; 
	pUart = ComToUart(port);
	if (pUart == 0)
	{
		return 0;
	}
	if(pUart->usRxWrite >= pUart->usRxRead)
	{

		size = pUart->usRxWrite - pUart->usRxRead; 

	}
	else
	{
		size = pUart->usRxBufSize + pUart->usRxWrite - pUart->usRxRead;
	}
	 return size;
}




uint8_t Uart_GetFifo(COM_PORT_E port,uint8_t* ReadBuff,uint16_t ReadSize)
{
	UART_T *pUart;
 uint8_t Rollback = 0;
 uint16_t UsedBufSize = 0;
 uint16_t FirstPartLen = 0;
 uint16_t SecondPartLen = 0;
 uint16_t i = 0;
 pUart = ComToUart(port);
if (pUart == 0 || ReadSize ==0 )
 {
 return 0;
}
 if(pUart->usRxWrite >= pUart->usRxRead)
 {
UsedBufSize = pUart->usRxWrite - pUart->usRxRead;
 Rollback = 0; 
}
else
 {
 UsedBufSize = pUart->usRxBufSize + pUart->usRxWrite - pUart->usRxRead;
 Rollback = 1;
 }
if(UsedBufSize < ReadSize)
{
 return 0;
 }

 if(Rollback)
{
FirstPartLen = pUart->usRxBufSize -pUart->usRxRead;
if(FirstPartLen >= ReadSize) 
 { 
 for(i = 0; i < ReadSize; i++)
 {
ReadBuff[i] = pUart->pRxBuf[pUart->usRxRead + i];
 }
 }
else 
 {
for(i = 0; i < FirstPartLen; i++)
 {
 ReadBuff[i] = pUart->pRxBuf[pUart->usRxRead + i];
 }

 SecondPartLen = ReadSize - FirstPartLen;
for(i = 0; i < SecondPartLen; i++)
 {
 ReadBuff[FirstPartLen + i] = pUart->pRxBuf[i];
 }
 }
 }
else
{
 for(i = 0; i < ReadSize; i++)
 {
ReadBuff[i] = pUart->pRxBuf[pUart->usRxRead + i];
} 
 }

 pUart->usRxRead = (pUart->usRxRead+ ReadSize)%pUart->usRxBufSize;

 return 1;

}









/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartIRQ(UART_T *_pUart)
{
	/* 处理接收中断  */
	if (USART_GetITStatus(_pUart->uart, USART_IT_RXNE) != RESET)
	{
		/* 从串口接收数据寄存器读取数据存放到接收FIFO */
		uint8_t ch;

		//在接收中断里面读取到接收移位寄存器的值并将值存储到FIFO中，然后通过UartGetChar()函数读取缓冲区的值
		ch = USART_ReceiveData(_pUart->uart);        //通过库函数从接收移位寄存器中读取收到的数据
		_pUart->pRxBuf[_pUart->usRxWrite] = ch;      //将数据存入接收缓冲区，每进入中断一次存取一次
		if (++_pUart->usRxWrite >= _pUart->usRxBufSize)    //如果接收写指针移动到FIFO的顶端，则复位接收写指针
		{
			_pUart->usRxWrite = 0;
		}
		if (_pUart->usRxCount < _pUart->usRxBufSize)     //如果还未读取的新数据个数小于缓冲区大小，则继续接收未读取数据个数 
		{
			_pUart->usRxCount++;
		}

		/* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
		//if (_pUart->usRxWrite == _pUart->usRxRead)
		//if (_pUart->usRxCount == 1)
		{
			if (_pUart->ReciveNew)
			{
				_pUart->ReciveNew(ch);
			}
		}
	}

	/* 处理发送缓冲区空中断 */
	if (USART_GetITStatus(_pUart->uart, USART_IT_TXE) != RESET)
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0)
		{
			/* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
			USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);

			/* 使能数据发送完毕中断 */
			USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
		}
		else
		{
			/* 从发送FIFO取1个字节写入串口发送数据寄存器 */
			USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);  //此条语句通过调用库函数实现
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)      //如果发送读指针移动到缓冲区FIFO的顶端，复位发送读指针
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;    //每发送一个字节之后待发送数据个数减一
		}

