LIUGUOXIA/Demo/STM32-F1bsp-2022-9-29/STM32-F1bsp/BSP/src/bsp_uart_fifo.c
	}
	/* 数据bit位全部发送完毕的中断 */
	else if (USART_GetITStatus(_pUart->uart, USART_IT_TC) != RESET)
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0)
		{
			/* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
			USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);

			/* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
			if (_pUart->SendOver)
			{
				_pUart->SendOver();
			}
		}
		else
		{
			/* 正常情况下，不会进入此分支 */

			/* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */   //正常情况下，不会进入这个分支
			USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);      
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)        //进入此分支后，再次发送缓冲区的值
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
	UartIRQ(&g_tUart1);
}
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void)
{
	UartIRQ(&g_tUart2);
}
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
	UartIRQ(&g_tUart3);
}
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void)
{
	UartIRQ(&g_tUart4);
}
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void)
{
	UartIRQ(&g_tUart5);
}
#endif

#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void)
{
	UartIRQ(&g_tUart6);
}
#endif

/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
#if 1	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
	comSendChar(COM1, ch);

	return ch;
#else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
	/* 写一个字节到USART1 */
	USART_SendData(USART1, (uint8_t) ch);

	/* 等待发送结束 */
	while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
	{}

	return ch;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

#if 1	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
	uint8_t ucData;

	while(comGetChar(COM1, &ucData) == 0);

	return ucData;
#else
	/* 等待串口1输入数据 */
	while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET);

	return (int)USART_ReceiveData(USART1);
#endif
}


void my_printf(void)
{
	printf("调用硬件定时器成功\r\n");
}
/*
**********************************************************************************************
*函 数 名：
*功能说明：
*形    参：
*返 回 值：
*
**********************************************************************************************
*/
void UART_5msMainFunction(void)      //任务调用接口
{
	#if 1
	uint8_t cmd;
	uint8_t ret = 0;
	uint32_t time = 0;
	static uint16_t duty = 0;
	if(comGetChar(COM1, &cmd))
	{
			switch(cmd)
			{
				 case '1':
				 bsp_StartTimer(1, 10);
			break;
			case'2':
			ret  = bsp_CheckTimer(1);
			if(ret == 1)
			{
					printf("软件定时器1 is ok\r\n");
			}
			else
			{
			
			}
				break;
			case '3':
				time = bsp_GetRunTime();
				printf("系统运行时间%d\r\n",time);
					break;
			case '4':
				bsp_StartHardTimer(1, 1000, my_printf);
				break;
				case '5':
				LED_SetStatus(LED_DETECT_WORK,1);
				break;
				
				case '6':
				Beep_SetStatus(BEEP_START_WORK,1);       //不响
//				Beep_SetStatus(BEEP_DOING_WORK,1);       //不响
//				GPIO_SetBits(GPIO_PORT_BEEP,GPIO_PIN_BEEP);
//				BEEP_Pro();    //不响
//				BEEP_ENABLE();
				printf("Beep is ok");
				break;
				case '7':
					duty+=10;
				if(duty>255)
				{
					duty = 0;
					
				}
				printf("duty:%d\r\n",duty);
			  bsp_SetTIMOutPWM(GPIOB, GPIO_Pin_5, TIM3, 2, 20000, (duty * 10000) /255);	
				bsp_SetTIMOutPWM(GPIOB, GPIO_Pin_0, TIM3, 3, 20000, (duty * 10000) /255);	
				bsp_SetTIMOutPWM(GPIOB, GPIO_Pin_1, TIM3, 4, 20000, (duty * 10000) /255);
				break;
				
//				case '8':
//				bsp_StartAutoTimer(3, 100);
//				printf("自动定时器启动");
//				break;
//				
//				case '9':
//					PwmLed_SetDuty(0,0);
//				  break;
//				
				  case '8':
					BEEP_Start(5, 1, 1);	/* 鸣叫50ms，停10ms， 1次 */
				  break;
					case '9':
//					BEEP_Stop();    //不能关闭
					BEEP_DISABLE();
					Beep_SetStatus(BEEP_START_WORK,0);       //不响
					break;
				
			}
	}
	#endif
	
	#if 0
	uint8_t size = 0;
	static uint8_t current_len = 0;
	static uint8_t last_len = 0;
	size = Uart_GetFifoSize(COM1);
	current_len = size;
	if(current_len != last_len)
	{
	  printf("current =%d\r\n",current_len);
		last_len = current_len;
	}
	else
	{
	
	}
	
	#endif
	
	#if 0
	uint16_t size = 0;
	uint8_t ret = 0;
	uint8_t ReadData[10];
	size = Uart_GetFifoSize(COM1);
	ret = Uart_GetFifo(COM1,ReadData,size);
	if(ret == 1)
	{
			for(int i = 0; i < size; i++)
		{
				printf("RaedData[%d]= %c\r\n",i, ReadData[i]);
		}
	}
	else
	{

	}
	#endif
	
	#if 0
		uint8_t ret = 0;
	  uint8_t cmd;
	if(comGetChar(COM1, &cmd))
	{
		switch(cmd)
		{
			case '1':
				printf("cmd = %d\r\n",cmd);
		    LED_SetStatus(LED_START_WORK,1);
				printf("LED is BLUE\r\n");
			break;
			
				case '2':
				printf("cmd = %d\r\n",cmd);
		    LED_SetStatus(LED_START_WORK,0);
				printf("LED is OFF\r\n");
			break;
			
				case '3':
				printf("cmd = %d\r\n",cmd);
		    LED_SetStatus(LED_DETECT_WORK,1);
				printf("LED is RED\r\n");
			break;
				
				case '4':
				printf("cmd = %d\r\n",cmd);
		    LED_SetStatus(LED_DETECT_WORK,0);
				printf("LED is OVER\r\n");
			break;
		}
	#endif
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
